name: "cc_fraud_detect_model"
backend: "ibmsnapml"
max_batch_size: 32 
input [
  {
    name: "IN0"
    data_type: TYPE_FP32
    dims: [ 28 ]
  }
]
output [
  {
    name: "OUT0"
    data_type: TYPE_FP64
    dims: [ 4 ]
  }
]

instance_group [
  {
    count: 2
    kind: KIND_CPU 
  }
]

dynamic_batching {   
  preferred_batch_size: [ 32 ]
  max_queue_delay_microseconds: 500
}
parameters {
  key: "MODEL_FILE_FORMAT"
  value {
    string_value: "pmml"
  }
}

